In [1]:
import pandas as pd
import numpy as np

Q1. Write a Pandas program to join the two given dataframes "student_data1", "student_data2" along rows and assign all data.

Output:

      student_id	   name           	marks
    0	S1	        Danniella Fenton	200
    1	S2	        Ryder Storey    	210
    2	S3	        Bryce Jensen    	190
    3	S4	        Ed Bernal	       222
    4	S5	        Kwame Morin	     199
    0	S4	        Scarlette Fisher	201
    1	S5	        Carla Williamson	200
    2	S6	        Dante Morse	     198
    3	S7	        Kaiser William	  219
    4	S8	        Madeeha Preston	 201

In [2]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [3]:
student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [4]:
student_data=pd.concat([student_data1, student_data2])
student_data

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

Q2. Write a Pandas program to join the two above dataframes along columns and assign all data.

In [5]:
pd.concat([student_data1, student_data2], axis = 1)

  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton    200         S4  Scarlette Fisher    201
1         S2      Ryder Storey    210         S5  Carla Williamson    200
2         S3      Bryce Jensen    190         S6       Dante Morse    198
3         S4         Ed Bernal    222         S7    Kaiser William    219
4         S5       Kwame Morin    199         S8   Madeeha Preston    201

Q3. Write a Pandas program to append a row "s6" to an existing DataFrame "student_data1" and display the combined data.

s6 = ['S6', 'Scarlette Fisher', 205]

In [6]:
s6 = ['S6', 'Scarlette Fisher', 205]
s6_s = pd.Series(['S6', 'Scarlette Fisher', 205], index=['student_id', 'name', 'marks'])

In [7]:
# Sol-1
student_data1.append(s6_s, ignore_index = True)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S6  Scarlette Fisher    205

Q4. Write a Pandas program to append a list of dictioneries "dicts" to a existing DataFrame "student_data1" and display the combined data.

In [8]:
dicts = [{'student_id': 'S6', 'name': 'Scarlette Fisher', 'marks': 203},
         {'student_id': 'S7', 'name': 'Bryce Jensen', 'marks': 207}]

In [9]:
student_data1.append(dicts, ignore_index=True, sort=False)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S6  Scarlette Fisher    203
6         S7      Bryce Jensen    207

Q5. Write a Pandas program to 

  a. join the two given dataframes "student_data1" & "student_data2" along rows and

  b. merge with another dataframe "exam_data" to fetch exam id's for all student's.

In [10]:
exam_data = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})
exam_data

   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12

In [11]:
df1 = pd.concat([student_data1, student_data2])
df1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [12]:
pd.merge(df1, exam_data, on='student_id')  
# default type on how to merge is "inner"
# merge inner = intersection on key values

  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33

Q6. Write a Pandas program to join the two dataframes "student_data1", "student_data2" and get information of repeated student_id's only.

In [13]:
pd.merge(student_data1, student_data2, on='student_id', how='inner')  
# s4, s5 are repeated rows in two DF's.
# _x is left DF info and _y is the right DF info

  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

Q7. Write a Pandas program to join the two dataframes "student_data1", "student_data2" side by side, keep all records of both DF's and allign matching records of both DF's in same row.

In [14]:
pd.merge(student_data1, student_data2, on='student_id', how='outer')

  student_id            name_x  marks_x            name_y  marks_y
0         S1  Danniella Fenton    200.0               NaN      NaN
1         S2      Ryder Storey    210.0               NaN      NaN
2         S3      Bryce Jensen    190.0               NaN      NaN
3         S4         Ed Bernal    222.0  Scarlette Fisher    201.0
4         S5       Kwame Morin    199.0  Carla Williamson    200.0
5         S6               NaN      NaN       Dante Morse    198.0
6         S7               NaN      NaN    Kaiser William    219.0
7         S8               NaN      NaN   Madeeha Preston    201.0

Q8. Write a Pandas program to join (left join) the two dataframes using keys from left dataframe only.

In [15]:
data1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'P': ['P0', 'P1', 'P2', 'P3'],
                     'Q': ['Q0', 'Q1', 'Q2', 'Q3']})
data1

  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3

In [16]:
data2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'R': ['R0', 'R1', 'R2', 'R3'],
                      'S': ['S0', 'S1', 'S2', 'S3']})
data2

  key1 key2   R   S
0   K0   K0  R0  S0
1   K1   K0  R1  S1
2   K1   K0  R2  S2
3   K2   K0  R3  S3

In [17]:
# Merged Data (keys from data1): ** merge w.r.t multiple columns is also possiable
pd.merge(data1, data2, how='left', on=['key1', 'key2'])

  key1 key2   P   Q    R    S
0   K0   K0  P0  Q0   R0   S0
1   K0   K1  P1  Q1  NaN  NaN
2   K1   K0  P2  Q2   R1   S1
3   K1   K0  P2  Q2   R2   S2
4   K2   K1  P3  Q3  NaN  NaN

In [18]:
# Merged Data (keys from data2):
pd.merge(data2, data1, how='left', on=['key1', 'key2'])

  key1 key2   R   S    P    Q
0   K0   K0  R0  S0   P0   Q0
1   K1   K0  R1  S1   P2   Q2
2   K1   K0  R2  S2   P2   Q2
3   K2   K0  R3  S3  NaN  NaN

Q9. Write a Pandas program to join two dataframes using keys from right dataframe only.

In [19]:
# Merged Data (keys from data2):
pd.merge(data1, data2, how='right', on=['key1', 'key2'])

  key1 key2    P    Q   R   S
0   K0   K0   P0   Q0  R0  S0
1   K1   K0   P2   Q2  R1  S1
2   K1   K0   P2   Q2  R2  S2
3   K2   K0  NaN  NaN  R3  S3

In [20]:
# Merged Data (keys from data1):
pd.merge(data2, data1, how='right', on=['key1', 'key2'])

  key1 key2    R    S   P   Q
0   K0   K0   R0   S0  P0  Q0
1   K1   K0   R1   S1  P2  Q2
2   K1   K0   R2   S2  P2  Q2
3   K0   K1  NaN  NaN  P1  Q1
4   K2   K1  NaN  NaN  P3  Q3

Q10. Write a Pandas program to merge two given datasets using multiple join keys.

In [21]:
pd.merge(data1, data2, on=['key1', 'key2']) #default value of how to merge is: how=inner (intersection)

  key1 key2   P   Q   R   S
0   K0   K0  P0  Q0  R0  S0
1   K1   K0  P2  Q2  R1  S1
2   K1   K0  P2  Q2  R2  S2

Q11. Write a Pandas program to create a combination from two dataframes where a column id combination appears more than once in both dataframes.

In [22]:
pd.merge(data1, data2, on='key1') # many-to-many join case

  key1 key2_x   P   Q key2_y   R   S
0   K0     K0  P0  Q0     K0  R0  S0
1   K0     K1  P1  Q1     K0  R0  S0
2   K1     K0  P2  Q2     K0  R1  S1
3   K1     K0  P2  Q2     K0  R2  S2
4   K2     K1  P3  Q3     K0  R3  S3

Q12. Write a Pandas program to merge two given dataframes with different columns.

In [23]:
pd.concat([data1,data2], axis=0, ignore_index=True) # axis=0 rows

  key1 key2    P    Q    R    S
0   K0   K0   P0   Q0  NaN  NaN
1   K0   K1   P1   Q1  NaN  NaN
2   K1   K0   P2   Q2  NaN  NaN
3   K2   K1   P3   Q3  NaN  NaN
4   K0   K0  NaN  NaN   R0   S0
5   K1   K0  NaN  NaN   R1   S1
6   K1   K0  NaN  NaN   R2   S2
7   K2   K0  NaN  NaN   R3   S3

Q13. Write a Pandas program to 

  a. create a new DataFrame based on existing series "s1","s2","s3" as columns and 

  b. override the existing columns names with 'column1', 'column2', 'column3'.

In [24]:
s1 = pd.Series([0, 1, 2, 3], name='col1')
s2 = pd.Series([0, 1, 2, 3])
s3 = pd.Series([0, 1, 4, 5], name='col3')

In [25]:
pd.concat([s1, s2, s3], axis=1, keys=['column1', 'column2', 'column3']) # axis=1 columns

   column1  column2  column3
0        0        0        0
1        1        1        1
2        2        2        4
3        3        3        5

Q14. Write a Pandas program to combine the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [26]:
data1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])
data1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [27]:
data2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                     index=['K0', 'K2', 'K3'])
data2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [28]:
data1.join(data2) # Join columns of another DataFrame.

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

Q.15 Write a Pandas program to Combine two DataFrame objects by filling null values in one DataFrame with non-null values from other DataFrame.

In [31]:
df1 = pd.DataFrame({'A': [None, 0, None], 'B': [3, 4, 5]})
df1

     A  B
0  NaN  3
1  0.0  4
2  NaN  5

In [32]:
df2 = pd.DataFrame({'A': [1, 1, 3], 'B': [3, None, 3]})
df2

   A    B
0  1  3.0
1  1  NaN
2  3  3.0

In [29]:
df1.combine_first(df2)
# combine_first - Update null elements with value in the same location in `other` df

     A  B
0  1.0  3
1  0.0  4
2  3.0  5

In [33]:
df2.combine_first(df1)

   A    B
0  1  3.0
1  1  4.0
2  3  3.0